backend/models/Admin.php

UPDATE `xsd_admin` SET `token`='aaaaaaaaa', `updated_at`=1545368095 WHERE `id`=9
---
    public function setToken()
    {
        $this->scenario = 'setToken';
        $token = 'aaaaaaaaa';
        $this->token = $token;
        if (!$this->save()) {

SELECT * FROM `xsd_admin` WHERE `token`='uuuuu'
---
    public function findOneByToken($token)
    {
        $model = self::findOne(['token' => $token]);

SELECT * FROM `xsd_admin` WHERE `accounts`='10003'
---
    public function findOneByAccounts($accounts)
    {
        $model = self::findOne(['accounts' => $accounts]);