backend/models/Banner.php

SELECT * FROM `xsd_banner` WHERE `id`='2'
---
    public function findOneById($id)
    {
        $model = self::findOne(['id' => $id]);

UPDATE `xsd_banner` SET `banner_name`='ooo', `source`=1, `updated_at`=1545381814 WHERE `id`=1
---
    public function beforeSave($insert)
    {
        if ($this->isNewRecord) {
            $this->is_delete = self::DELETE_NOT;
            $this->created_at = time();
            $this->updated_at = time();
        } else {
            $this->updated_at = time();

UPDATE `xsd_banner` SET `banner_name`='o9', `updated_at`=1545381935 WHERE `id`=1
---
    public function modify($params)
    {
        $this->scenario = 'update';
        $this->attributes = $params;
        if ($this->save()) {

SELECT * FROM `xsd_banner_item` WHERE (`is_delete`=0) AND (`id`=2) AND (`end_time` > 1545383567)
UPDATE `xsd_banner` SET `is_delete`=1, `updated_at`=1545383567 WHERE `id`=2
---
    public function del()
    {
        $this->is_delete = self::DELETED;

        $bi = BannerItem::find()
            ->where(['is_delete' => self::DELETE_NOT])
            ->andWhere(['id' => $this->id])
            ->andWhere(['>', 'end_time', time()])
            ->one();

        if ($bi != null) {
            return false;
        }

        if ($this->save()) {