backend/models/BannerItem.php

    public function findOneById($id)
    {
        $model = self::findOne(['id' => $id]);
---
SELECT * FROM `xsd_banner_item` WHERE `id`='1'

    public function modify($params)
    {
        $this->scenario = 'update';
        $this->attributes = $params;
        if ($this->save()) {
---
UPDATE `xsd_banner_item` SET `banner_name`='dfgf', `updated_at`=1545384185 WHERE `id`=1

    public function del()
    {
        $this->is_delete = self::DELETED;
        if ($this->save()) {
---
UPDATE `xsd_banner_item` SET `is_delete`=1, `updated_at`=1545383840 WHERE `id`=1